zephyrproject-rtos/zephyr/soc/nxp/imxrt/imxrt11xx/soc.c
	/* ERR050396
	 * Errata description:
	 *  AXI to AHB conversion for CM7 AHBS port (port to access CM7 to TCM) is by a NIC301
	 *  block, instead of XHB400 block. NIC301 doesn't support sparse write conversion.
	 *  Any AXI to AHB conversion need XHB400, not by NIC. This will result in data corruption
	 *  in case of AXI sparse write reaches the NIC301 ahead of AHBS.
	 * Errata workaround:
	 *  For uSDHC, don't set the bit#1 of IOMUXC_GPR28 (AXI transaction is cacheable), if write
	 *  data to TCM aligned in 4 bytes; No such write access limitation for OCRAM or external
	 *  RAM
	 */
	IOMUXC_GPR->GPR28 &= (~IOMUXC_GPR_GPR28_AWCACHE_USDHC_MASK);
#endif

	return 0;
}

/*
 * Stack pointer is not set at this point in the early init, but we call C
 * functions from the SOC reset.
 * Set a stack pointer so that C functions will work correctly
 */

#ifdef CONFIG_SOC_RESET_HOOK
__asm__ (
	".global soc_reset_hook\n"
	"soc_reset_hook:\n"
	"ldr r0, =z_main_stack+"STRINGIFY(CONFIG_MAIN_STACK_SIZE)";\n"
	"msr msp, r0;\n"
	"b _soc_reset_hook;\n"
);

void __used _soc_reset_hook(void)
{
	SystemInit();

#if defined(FLEXRAM_RUNTIME_BANKS_USED)
	/* Configure flexram if not running from RAM */
	flexram_dt_partition();
#endif
}
#endif

SYS_INIT(imxrt_init, PRE_KERNEL_1, 0);

#if defined(CONFIG_SECOND_CORE_MCUX) && defined(CONFIG_CPU_CORTEX_M7)
/**
 * @brief Kickoff secondary core.
 *
 * Kick the secondary core out of reset and wait for it to indicate boot. The
 * core image was already copied to RAM (and the boot address was set) in
 * imxrt_init()
 *
 * @return 0
 */
static int second_core_boot(void)
{
	/* Kick CM4 core out of reset */
	SRC->CTRL_M4CORE = SRC_CTRL_M4CORE_SW_RESET_MASK;
	SRC->SCR |= SRC_SCR_BT_RELEASE_M4_MASK;
#if DUAL_CORE_MU_ENABLED
	/* Wait for the secondary core to start up and set boot flag in
	 * imxrt_init
	 */
	while (MU_GetFlags(MU_BASE) != BOOT_FLAG) {
		/* Wait for secondary core to set flag */
	}
#endif
	return 0;
}

SYS_INIT(second_core_boot, PRE_KERNEL_2, CONFIG_KERNEL_INIT_PRIORITY_DEFAULT);
#endif
